//Вывести на консоль текст “Hello World!”:
//1. Скачать и установить IntelliJ IDEA.
//2. Написать первую программу, которая выводит в консоль строку “Hello World!”.
//3. Подключиться к GitHub, залить программу в созданный репозиторий.

public class TaskWork01 {
    public static void main(String[] args) {
        System.out.println("Hello World!");
    }
}
