//Создание переменных:
//1. Создайте переменную типа с плавающей точкой с наибольшим диапазоном чисел.
//Присвойте ей произвольное дробное значение.
//2. Создайте переменную целочисленного типа с наименьшим диапазоном чисел.
//Присвойте  ей наибольшее возможное значение.

public class TaskWork02 {
    public static void main(String[] args) {
        //переменная типа с плавающей точкой с наибольшим диапозоном
        //задано произвольное дробное значение
        double num1 = 4815162342.877856;
        //переменная целочисленного типа с наименьшим диапозоном
        //задано наибольшее значение
        byte mum2 = 127;
    }
}
